MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024EFE124/mcu.h
extern volatile __CNPDJbits_t CNPDJbits __asm__ ("CNPDJ") __attribute__((section("sfrs"), address(0xBF860860)));
extern volatile uint32_t        CNPDJCLR __attribute__((section("sfrs"),address(0xBF860864)));
extern volatile uint32_t        CNPDJSET __attribute__((section("sfrs"),address(0xBF860868)));
extern volatile uint32_t        CNPDJINV __attribute__((section("sfrs"),address(0xBF86086C)));
#define CNCONJ CNCONJ
extern volatile uint32_t   CNCONJ __attribute__((section("sfrs"), address(0xBF860870)));
typedef union {
  struct {
    uint32_t :11;
    uint32_t EDGEDETECT:1;
    uint32_t :3;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONJbits_t;
extern volatile __CNCONJbits_t CNCONJbits __asm__ ("CNCONJ") __attribute__((section("sfrs"), address(0xBF860870)));
extern volatile uint32_t        CNCONJCLR __attribute__((section("sfrs"),address(0xBF860874)));
extern volatile uint32_t        CNCONJSET __attribute__((section("sfrs"),address(0xBF860878)));
extern volatile uint32_t        CNCONJINV __attribute__((section("sfrs"),address(0xBF86087C)));
#define CNENJ CNENJ
extern volatile uint32_t   CNENJ __attribute__((section("sfrs"), address(0xBF860880)));
typedef union {
  struct {
    uint32_t CNIEJ0:1;
    uint32_t CNIEJ1:1;
    uint32_t CNIEJ2:1;
    uint32_t :1;
    uint32_t CNIEJ4:1;
    uint32_t :3;
    uint32_t CNIEJ8:1;
    uint32_t CNIEJ9:1;
    uint32_t :1;
    uint32_t CNIEJ11:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENJbits_t;
extern volatile __CNENJbits_t CNENJbits __asm__ ("CNENJ") __attribute__((section("sfrs"), address(0xBF860880)));
extern volatile uint32_t        CNENJCLR __attribute__((section("sfrs"),address(0xBF860884)));
extern volatile uint32_t        CNENJSET __attribute__((section("sfrs"),address(0xBF860888)));
extern volatile uint32_t        CNENJINV __attribute__((section("sfrs"),address(0xBF86088C)));
#define CNSTATJ CNSTATJ
extern volatile uint32_t   CNSTATJ __attribute__((section("sfrs"), address(0xBF860890)));
typedef union {
  struct {
    uint32_t CNSTATJ0:1;
    uint32_t CNSTATJ1:1;
    uint32_t CNSTATJ2:1;
    uint32_t CNSTATJ3:1;
    uint32_t :1;
    uint32_t CNSTATJ5:1;
    uint32_t :3;
    uint32_t CNSTATJ9:1;
    uint32_t :1;
    uint32_t CNSTATJ11:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATJbits_t;
extern volatile __CNSTATJbits_t CNSTATJbits __asm__ ("CNSTATJ") __attribute__((section("sfrs"), address(0xBF860890)));
extern volatile uint32_t        CNSTATJCLR __attribute__((section("sfrs"),address(0xBF860894)));
extern volatile uint32_t        CNSTATJSET __attribute__((section("sfrs"),address(0xBF860898)));
extern volatile uint32_t        CNSTATJINV __attribute__((section("sfrs"),address(0xBF86089C)));
#define CNNEJ CNNEJ
extern volatile uint32_t   CNNEJ __attribute__((section("sfrs"), address(0xBF8608A0)));
typedef struct {
  uint32_t CNNEJ0:1;
  uint32_t CNNEJ1:1;
  uint32_t CNNEJ2:1;
  uint32_t :1;
  uint32_t CNNEJ4:1;
  uint32_t :3;
  uint32_t CNNEJ8:1;
  uint32_t CNNEJ9:1;
  uint32_t :1;
  uint32_t CNNEJ11:1;
} __CNNEJbits_t;
extern volatile __CNNEJbits_t CNNEJbits __asm__ ("CNNEJ") __attribute__((section("sfrs"), address(0xBF8608A0)));
extern volatile uint32_t        CNNEJCLR __attribute__((section("sfrs"),address(0xBF8608A4)));
extern volatile uint32_t        CNNEJSET __attribute__((section("sfrs"),address(0xBF8608A8)));
extern volatile uint32_t        CNNEJINV __attribute__((section("sfrs"),address(0xBF8608AC)));
#define CNFJ CNFJ
extern volatile uint32_t   CNFJ __attribute__((section("sfrs"), address(0xBF8608B0)));
typedef struct {
  uint32_t CNFJ0:1;
  uint32_t CNFJ1:1;
  uint32_t CNFJ2:1;
  uint32_t :1;
  uint32_t CNFJ4:1;
  uint32_t :3;
  uint32_t CNFJ8:1;
  uint32_t CNFJ9:1;
  uint32_t :1;
  uint32_t CNFJ11:1;
} __CNFJbits_t;
extern volatile __CNFJbits_t CNFJbits __asm__ ("CNFJ") __attribute__((section("sfrs"), address(0xBF8608B0)));
extern volatile uint32_t        CNFJCLR __attribute__((section("sfrs"),address(0xBF8608B4)));
extern volatile uint32_t        CNFJSET __attribute__((section("sfrs"),address(0xBF8608B8)));
extern volatile uint32_t        CNFJINV __attribute__((section("sfrs"),address(0xBF8608BC)));
#define ETHCON1 ETHCON1
extern volatile uint32_t   ETHCON1 __attribute__((section("sfrs"), address(0xBF882000)));
typedef union {
  struct {
    uint32_t BUFCDEC:1;
    uint32_t :3;
    uint32_t MANFC:1;
    uint32_t :2;
    uint32_t AUTOFC:1;
    uint32_t RXEN:1;
    uint32_t TXRTS:1;
    uint32_t :3;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t PTV:16;
  };
  struct {
    uint32_t w:32;
  };
} __ETHCON1bits_t;
extern volatile __ETHCON1bits_t ETHCON1bits __asm__ ("ETHCON1") __attribute__((section("sfrs"), address(0xBF882000)));
extern volatile uint32_t        ETHCON1CLR __attribute__((section("sfrs"),address(0xBF882004)));
extern volatile uint32_t        ETHCON1SET __attribute__((section("sfrs"),address(0xBF882008)));
extern volatile uint32_t        ETHCON1INV __attribute__((section("sfrs"),address(0xBF88200C)));
#define ETHCON2 ETHCON2
extern volatile uint32_t   ETHCON2 __attribute__((section("sfrs"), address(0xBF882010)));
typedef union {
  struct {
    uint32_t :4;
    uint32_t RXBUF_SZ:7;
  };
  struct {
    uint32_t w:32;
  };
} __ETHCON2bits_t;
extern volatile __ETHCON2bits_t ETHCON2bits __asm__ ("ETHCON2") __attribute__((section("sfrs"), address(0xBF882010)));
extern volatile uint32_t        ETHCON2CLR __attribute__((section("sfrs"),address(0xBF882014)));
extern volatile uint32_t        ETHCON2SET __attribute__((section("sfrs"),address(0xBF882018)));
extern volatile uint32_t        ETHCON2INV __attribute__((section("sfrs"),address(0xBF88201C)));
#define ETHTXST ETHTXST
extern volatile uint32_t   ETHTXST __attribute__((section("sfrs"), address(0xBF882020)));
typedef union {
  struct {
    uint32_t :2;
    uint32_t TXSTADDR:30;
  };
  struct {
    uint32_t w:32;
  };
} __ETHTXSTbits_t;
extern volatile __ETHTXSTbits_t ETHTXSTbits __asm__ ("ETHTXST") __attribute__((section("sfrs"), address(0xBF882020)));
extern volatile uint32_t        ETHTXSTCLR __attribute__((section("sfrs"),address(0xBF882024)));
extern volatile uint32_t        ETHTXSTSET __attribute__((section("sfrs"),address(0xBF882028)));
extern volatile uint32_t        ETHTXSTINV __attribute__((section("sfrs"),address(0xBF88202C)));
#define ETHRXST ETHRXST
extern volatile uint32_t   ETHRXST __attribute__((section("sfrs"), address(0xBF882030)));
typedef union {
  struct {
    uint32_t :2;
    uint32_t RXSTADDR:30;
  };
  struct {
    uint32_t w:32;
  };
} __ETHRXSTbits_t;
extern volatile __ETHRXSTbits_t ETHRXSTbits __asm__ ("ETHRXST") __attribute__((section("sfrs"), address(0xBF882030)));
extern volatile uint32_t        ETHRXSTCLR __attribute__((section("sfrs"),address(0xBF882034)));
extern volatile uint32_t        ETHRXSTSET __attribute__((section("sfrs"),address(0xBF882038)));
extern volatile uint32_t        ETHRXSTINV __attribute__((section("sfrs"),address(0xBF88203C)));
#define ETHHT0 ETHHT0
extern volatile uint32_t   ETHHT0 __attribute__((section("sfrs"), address(0xBF882040)));
typedef union {
  struct {
    uint32_t w:32;
  };
  struct {
    uint32_t HTLOWER:32;
  };
} __ETHHT0bits_t;
