MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024EFE124/mcu.h
extern volatile __SQI1INTSIGENbits_t SQI1INTSIGENbits __asm__ ("SQI1INTSIGEN") __attribute__((section("sfrs"), address(0xBF8E2058)));
#define SQI1TAPCON SQI1TAPCON
extern volatile uint32_t   SQI1TAPCON __attribute__((section("sfrs"), address(0xBF8E205C)));
typedef struct {
  uint32_t CLKOUTDLY:4;
  uint32_t DATAOUTDLY:4;
  uint32_t SDRCLKINDLY:6;
} __SQI1TAPCONbits_t;
extern volatile __SQI1TAPCONbits_t SQI1TAPCONbits __asm__ ("SQI1TAPCON") __attribute__((section("sfrs"), address(0xBF8E205C)));
#define SQI1MEMSTAT SQI1MEMSTAT
extern volatile uint32_t   SQI1MEMSTAT __attribute__((section("sfrs"), address(0xBF8E2060)));
typedef struct {
  uint32_t STATCMD:16;
  uint32_t STATBYTES:2;
  uint32_t STATTYPE:2;
  uint32_t STATPOS:1;
} __SQI1MEMSTATbits_t;
extern volatile __SQI1MEMSTATbits_t SQI1MEMSTATbits __asm__ ("SQI1MEMSTAT") __attribute__((section("sfrs"), address(0xBF8E2060)));
#define SQI1XCON3 SQI1XCON3
extern volatile uint32_t   SQI1XCON3 __attribute__((section("sfrs"), address(0xBF8E2064)));
typedef struct {
  uint32_t INIT1CMD1:8;
  uint32_t INIT1CMD2:8;
  uint32_t INIT1CMD3:8;
  uint32_t INIT1TYPE:2;
  uint32_t INIT1COUNT:2;
  uint32_t INIT1SCHECK:1;
} __SQI1XCON3bits_t;
extern volatile __SQI1XCON3bits_t SQI1XCON3bits __asm__ ("SQI1XCON3") __attribute__((section("sfrs"), address(0xBF8E2064)));
#define SQI1XCON4 SQI1XCON4
extern volatile uint32_t   SQI1XCON4 __attribute__((section("sfrs"), address(0xBF8E2068)));
typedef struct {
  uint32_t INIT2CMD1:8;
  uint32_t INIT2CMD2:8;
  uint32_t INIT2CMD3:8;
  uint32_t INIT2TYPE:2;
  uint32_t INIT2COUNT:2;
  uint32_t INIT2SCHECK:1;
} __SQI1XCON4bits_t;
extern volatile __SQI1XCON4bits_t SQI1XCON4bits __asm__ ("SQI1XCON4") __attribute__((section("sfrs"), address(0xBF8E2068)));
#define USBCSR0 USBCSR0
extern volatile uint32_t   USBCSR0 __attribute__((section("sfrs"), address(0xBF8E3000)));
typedef struct {
  uint32_t FUNC:7;
  uint32_t :1;
  uint32_t SUSPEN:1;
  uint32_t SUSPMODE:1;
  uint32_t RESUME:1;
  uint32_t RESET:1;
  uint32_t HSMODE:1;
  uint32_t HSEN:1;
  uint32_t SOFTCONN:1;
  uint32_t ISOUPD:1;
  uint32_t EP0IF:1;
  uint32_t EP1TXIF:1;
  uint32_t EP2TXIF:1;
  uint32_t EP3TXIF:1;
  uint32_t EP4TXIF:1;
  uint32_t EP5TXIF:1;
  uint32_t EP6TXIF:1;
  uint32_t EP7TXIF:1;
} __USBCSR0bits_t;
extern volatile __USBCSR0bits_t USBCSR0bits __asm__ ("USBCSR0") __attribute__((section("sfrs"), address(0xBF8E3000)));
#define USBCSR1 USBCSR1
extern volatile uint32_t   USBCSR1 __attribute__((section("sfrs"), address(0xBF8E3004)));
typedef struct {
  uint32_t :1;
  uint32_t EP1RXIF:1;
  uint32_t EP2RXIF:1;
  uint32_t EP3RXIF:1;
  uint32_t EP4RXIF:1;
  uint32_t EP5RXIF:1;
  uint32_t EP6RXIF:1;
  uint32_t EP7RXIF:1;
  uint32_t :8;
  uint32_t EP0IE:1;
  uint32_t EP1TXIE:1;
  uint32_t EP2TXIE:1;
  uint32_t EP3TXIE:1;
  uint32_t EP4TXIE:1;
  uint32_t EP5TXIE:1;
  uint32_t EP6TXIE:1;
  uint32_t EP7TXIE:1;
} __USBCSR1bits_t;
extern volatile __USBCSR1bits_t USBCSR1bits __asm__ ("USBCSR1") __attribute__((section("sfrs"), address(0xBF8E3004)));
#define USBCSR2 USBCSR2
extern volatile uint32_t   USBCSR2 __attribute__((section("sfrs"), address(0xBF8E3008)));
typedef struct {
  uint32_t :1;
  uint32_t EP1RXIE:1;
  uint32_t EP2RXIE:1;
  uint32_t EP3RXIE:1;
  uint32_t EP4RXIE:1;
  uint32_t EP5RXIE:1;
  uint32_t EP6RXIE:1;
  uint32_t EP7RXIE:1;
  uint32_t :8;
  uint32_t SUSPIF:1;
  uint32_t RESUMEIF:1;
  uint32_t RESETIF:1;
  uint32_t SOFIF:1;
  uint32_t CONNIF:1;
  uint32_t DISCONIF:1;
  uint32_t SESSRQIF:1;
  uint32_t VBUSERRIF:1;
  uint32_t SUSPIE:1;
  uint32_t RESUMEIE:1;
  uint32_t RESETIE:1;
  uint32_t SOFIE:1;
  uint32_t CONNIE:1;
  uint32_t DISCONIE:1;
  uint32_t SESSRQIE:1;
  uint32_t VBUSERRIE:1;
} __USBCSR2bits_t;
extern volatile __USBCSR2bits_t USBCSR2bits __asm__ ("USBCSR2") __attribute__((section("sfrs"), address(0xBF8E3008)));
#define USBCSR3 USBCSR3
extern volatile uint32_t   USBCSR3 __attribute__((section("sfrs"), address(0xBF8E300C)));
typedef struct {
  uint32_t RFRMNUM:11;
  uint32_t :5;
  uint32_t ENDPOINT:4;
  uint32_t :4;
  uint32_t NAK:1;
  uint32_t TESTJ:1;
  uint32_t TESTK:1;
  uint32_t PACKET:1;
  uint32_t FORCEHS:1;
  uint32_t FORCEFS:1;
  uint32_t FIFOACC:1;
  uint32_t FORCEHST:1;
} __USBCSR3bits_t;
extern volatile __USBCSR3bits_t USBCSR3bits __asm__ ("USBCSR3") __attribute__((section("sfrs"), address(0xBF8E300C)));
#define USBIENCSR1 USBIENCSR1
extern volatile uint32_t   USBIENCSR1 __attribute__((section("sfrs"), address(0xBF8E3014)));
typedef union {
  struct {
    uint32_t RXMAXP:11;
    uint32_t MULT:5;
    uint32_t RXPKTRDY:1;
    uint32_t FIFOFULL:1;
    uint32_t ERROR:1;
    uint32_t DERRNAKT:1;
    uint32_t FLUSH:1;
    uint32_t REQPKT:1;
    uint32_t RXSTALL:1;
    uint32_t CLRDT:1;
    uint32_t INCOMPRX:1;
    uint32_t DATATGGL:1;
    uint32_t DATATWEN:1;
    uint32_t DMAREQMD:1;
    uint32_t PIDERR:1;
    uint32_t DMAREQEN:1;
    uint32_t AUTORQ:1;
    uint32_t AUTOCLR:1;
  };
  struct {
    uint32_t :18;
    uint32_t OVERRUN:1;
    uint32_t DATAERR:1;
    uint32_t :1;
    uint32_t SENDSTALL:1;
    uint32_t SENTSTALL:1;
    uint32_t :5;
    uint32_t DISNYET:1;
    uint32_t :1;
    uint32_t ISO:1;
  };
} __USBIENCSR1bits_t;
extern volatile __USBIENCSR1bits_t USBIENCSR1bits __asm__ ("USBIENCSR1") __attribute__((section("sfrs"), address(0xBF8E3014)));
#define USBFIFO0 USBFIFO0
extern volatile uint32_t   USBFIFO0 __attribute__((section("sfrs"), address(0xBF8E3020)));
typedef struct {
  uint32_t DATA:32;
} __USBFIFO0bits_t;
extern volatile __USBFIFO0bits_t USBFIFO0bits __asm__ ("USBFIFO0") __attribute__((section("sfrs"), address(0xBF8E3020)));
#define USBFIFO1 USBFIFO1
extern volatile uint32_t   USBFIFO1 __attribute__((section("sfrs"), address(0xBF8E3024)));
typedef struct {
  uint32_t DATA:32;
} __USBFIFO1bits_t;
extern volatile __USBFIFO1bits_t USBFIFO1bits __asm__ ("USBFIFO1") __attribute__((section("sfrs"), address(0xBF8E3024)));
#define USBFIFO2 USBFIFO2
extern volatile uint32_t   USBFIFO2 __attribute__((section("sfrs"), address(0xBF8E3028)));
typedef struct {
  uint32_t DATA:32;
} __USBFIFO2bits_t;
extern volatile __USBFIFO2bits_t USBFIFO2bits __asm__ ("USBFIFO2") __attribute__((section("sfrs"), address(0xBF8E3028)));
#define USBFIFO3 USBFIFO3
extern volatile uint32_t   USBFIFO3 __attribute__((section("sfrs"), address(0xBF8E302C)));
typedef struct {
  uint32_t DATA:32;
} __USBFIFO3bits_t;
extern volatile __USBFIFO3bits_t USBFIFO3bits __asm__ ("USBFIFO3") __attribute__((section("sfrs"), address(0xBF8E302C)));
#define USBFIFO4 USBFIFO4
extern volatile uint32_t   USBFIFO4 __attribute__((section("sfrs"), address(0xBF8E3030)));
typedef struct {
  uint32_t DATA:32;
} __USBFIFO4bits_t;
extern volatile __USBFIFO4bits_t USBFIFO4bits __asm__ ("USBFIFO4") __attribute__((section("sfrs"), address(0xBF8E3030)));
#define USBFIFO5 USBFIFO5
extern volatile uint32_t   USBFIFO5 __attribute__((section("sfrs"), address(0xBF8E3034)));
typedef struct {
  uint32_t DATA:32;
} __USBFIFO5bits_t;
extern volatile __USBFIFO5bits_t USBFIFO5bits __asm__ ("USBFIFO5") __attribute__((section("sfrs"), address(0xBF8E3034)));
#define USBFIFO6 USBFIFO6
extern volatile uint32_t   USBFIFO6 __attribute__((section("sfrs"), address(0xBF8E3038)));
typedef struct {
  uint32_t DATA:32;
} __USBFIFO6bits_t;
extern volatile __USBFIFO6bits_t USBFIFO6bits __asm__ ("USBFIFO6") __attribute__((section("sfrs"), address(0xBF8E3038)));
#define USBFIFO7 USBFIFO7
extern volatile uint32_t   USBFIFO7 __attribute__((section("sfrs"), address(0xBF8E303C)));
typedef struct {
  uint32_t DATA:32;
} __USBFIFO7bits_t;
extern volatile __USBFIFO7bits_t USBFIFO7bits __asm__ ("USBFIFO7") __attribute__((section("sfrs"), address(0xBF8E303C)));
#define USBOTG USBOTG
extern volatile uint32_t   USBOTG __attribute__((section("sfrs"), address(0xBF8E3060)));
typedef struct {
  uint32_t SESSION:1;
  uint32_t HOSTREQ:1;
  uint32_t HOSTMODE:1;
  uint32_t VBUS:2;
  uint32_t LSDEV:1;
  uint32_t FSDEV:1;
  uint32_t BDEV:1;
  uint32_t RXEDMA:1;
  uint32_t TXEDMA:1;
  uint32_t :6;
  uint32_t TXFIFOSZ:4;
  uint32_t TXDPB:1;
  uint32_t :3;
  uint32_t RXFIFOSZ:4;
  uint32_t RXDPB:1;
} __USBOTGbits_t;
extern volatile __USBOTGbits_t USBOTGbits __asm__ ("USBOTG") __attribute__((section("sfrs"), address(0xBF8E3060)));
#define USBFIFOA USBFIFOA
extern volatile uint32_t   USBFIFOA __attribute__((section("sfrs"), address(0xBF8E3064)));
typedef struct {
  uint32_t TXFIFOAD:13;
  uint32_t :3;
  uint32_t RXFIFOAD:13;
} __USBFIFOAbits_t;
extern volatile __USBFIFOAbits_t USBFIFOAbits __asm__ ("USBFIFOA") __attribute__((section("sfrs"), address(0xBF8E3064)));
#define USBHWVER USBHWVER
extern volatile uint32_t   USBHWVER __attribute__((section("sfrs"), address(0xBF8E306C)));
typedef struct {
  uint32_t VERMINOR:10;
  uint32_t VERMAJOR:5;
  uint32_t RC:1;
} __USBHWVERbits_t;
