MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024EFE124/mcu.h
#define _CNSTATJ_CNSTATJ3_POSITION               0x00000003
#define _CNSTATJ_CNSTATJ3_MASK                   0x00000008
#define _CNSTATJ_CNSTATJ3_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ5_POSITION               0x00000005
#define _CNSTATJ_CNSTATJ5_MASK                   0x00000020
#define _CNSTATJ_CNSTATJ5_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ9_POSITION               0x00000009
#define _CNSTATJ_CNSTATJ9_MASK                   0x00000200
#define _CNSTATJ_CNSTATJ9_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ11_POSITION              0x0000000B
#define _CNSTATJ_CNSTATJ11_MASK                  0x00000800
#define _CNSTATJ_CNSTATJ11_LENGTH                0x00000001

#define _CNSTATJ_w_POSITION                      0x00000000
#define _CNSTATJ_w_MASK                          0xFFFFFFFF
#define _CNSTATJ_w_LENGTH                        0x00000020

#define _CNNEJ_CNNEJ0_POSITION                   0x00000000
#define _CNNEJ_CNNEJ0_MASK                       0x00000001
#define _CNNEJ_CNNEJ0_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ1_POSITION                   0x00000001
#define _CNNEJ_CNNEJ1_MASK                       0x00000002
#define _CNNEJ_CNNEJ1_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ2_POSITION                   0x00000002
#define _CNNEJ_CNNEJ2_MASK                       0x00000004
#define _CNNEJ_CNNEJ2_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ4_POSITION                   0x00000004
#define _CNNEJ_CNNEJ4_MASK                       0x00000010
#define _CNNEJ_CNNEJ4_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ8_POSITION                   0x00000008
#define _CNNEJ_CNNEJ8_MASK                       0x00000100
#define _CNNEJ_CNNEJ8_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ9_POSITION                   0x00000009
#define _CNNEJ_CNNEJ9_MASK                       0x00000200
#define _CNNEJ_CNNEJ9_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ11_POSITION                  0x0000000B
#define _CNNEJ_CNNEJ11_MASK                      0x00000800
#define _CNNEJ_CNNEJ11_LENGTH                    0x00000001

#define _CNFJ_CNFJ0_POSITION                     0x00000000
#define _CNFJ_CNFJ0_MASK                         0x00000001
#define _CNFJ_CNFJ0_LENGTH                       0x00000001

#define _CNFJ_CNFJ1_POSITION                     0x00000001
#define _CNFJ_CNFJ1_MASK                         0x00000002
#define _CNFJ_CNFJ1_LENGTH                       0x00000001

#define _CNFJ_CNFJ2_POSITION                     0x00000002
#define _CNFJ_CNFJ2_MASK                         0x00000004
#define _CNFJ_CNFJ2_LENGTH                       0x00000001

#define _CNFJ_CNFJ4_POSITION                     0x00000004
#define _CNFJ_CNFJ4_MASK                         0x00000010
#define _CNFJ_CNFJ4_LENGTH                       0x00000001

#define _CNFJ_CNFJ8_POSITION                     0x00000008
#define _CNFJ_CNFJ8_MASK                         0x00000100
#define _CNFJ_CNFJ8_LENGTH                       0x00000001

#define _CNFJ_CNFJ9_POSITION                     0x00000009
#define _CNFJ_CNFJ9_MASK                         0x00000200
#define _CNFJ_CNFJ9_LENGTH                       0x00000001

#define _CNFJ_CNFJ11_POSITION                    0x0000000B
#define _CNFJ_CNFJ11_MASK                        0x00000800
#define _CNFJ_CNFJ11_LENGTH                      0x00000001

#define _ETHCON1_BUFCDEC_POSITION                0x00000000
#define _ETHCON1_BUFCDEC_MASK                    0x00000001
#define _ETHCON1_BUFCDEC_LENGTH                  0x00000001

#define _ETHCON1_MANFC_POSITION                  0x00000004
#define _ETHCON1_MANFC_MASK                      0x00000010
#define _ETHCON1_MANFC_LENGTH                    0x00000001

#define _ETHCON1_AUTOFC_POSITION                 0x00000007
#define _ETHCON1_AUTOFC_MASK                     0x00000080
#define _ETHCON1_AUTOFC_LENGTH                   0x00000001

#define _ETHCON1_RXEN_POSITION                   0x00000008
#define _ETHCON1_RXEN_MASK                       0x00000100
#define _ETHCON1_RXEN_LENGTH                     0x00000001

#define _ETHCON1_TXRTS_POSITION                  0x00000009
#define _ETHCON1_TXRTS_MASK                      0x00000200
#define _ETHCON1_TXRTS_LENGTH                    0x00000001

#define _ETHCON1_SIDL_POSITION                   0x0000000D
#define _ETHCON1_SIDL_MASK                       0x00002000
#define _ETHCON1_SIDL_LENGTH                     0x00000001

#define _ETHCON1_ON_POSITION                     0x0000000F
#define _ETHCON1_ON_MASK                         0x00008000
#define _ETHCON1_ON_LENGTH                       0x00000001

#define _ETHCON1_PTV_POSITION                    0x00000010
#define _ETHCON1_PTV_MASK                        0xFFFF0000
#define _ETHCON1_PTV_LENGTH                      0x00000010

#define _ETHCON1_w_POSITION                      0x00000000
#define _ETHCON1_w_MASK                          0xFFFFFFFF
#define _ETHCON1_w_LENGTH                        0x00000020

#define _ETHCON2_RXBUF_SZ_POSITION               0x00000004
#define _ETHCON2_RXBUF_SZ_MASK                   0x000007F0
#define _ETHCON2_RXBUF_SZ_LENGTH                 0x00000007

#define _ETHCON2_w_POSITION                      0x00000000
#define _ETHCON2_w_MASK                          0xFFFFFFFF
#define _ETHCON2_w_LENGTH                        0x00000020

#define _ETHTXST_TXSTADDR_POSITION               0x00000002
#define _ETHTXST_TXSTADDR_MASK                   0xFFFFFFFC
#define _ETHTXST_TXSTADDR_LENGTH                 0x0000001E

#define _ETHTXST_w_POSITION                      0x00000000
#define _ETHTXST_w_MASK                          0xFFFFFFFF
#define _ETHTXST_w_LENGTH                        0x00000020

#define _ETHRXST_RXSTADDR_POSITION               0x00000002
#define _ETHRXST_RXSTADDR_MASK                   0xFFFFFFFC
#define _ETHRXST_RXSTADDR_LENGTH                 0x0000001E

#define _ETHRXST_w_POSITION                      0x00000000
#define _ETHRXST_w_MASK                          0xFFFFFFFF
#define _ETHRXST_w_LENGTH                        0x00000020

#define _ETHHT0_w_POSITION                       0x00000000
#define _ETHHT0_w_MASK                           0xFFFFFFFF
#define _ETHHT0_w_LENGTH                         0x00000020

